from enum import Enum

class MenuChoiceResult(Enum):
  SINGLE = "Вы выбрали сыграть один раунд!"
  MARATHON = "Вы выбрали играть пока не надоест!"
  EXIT = "Вы выбрали выйти:("
  INVALID ="НЕ ПРАВИЛЬНЫЙ ВВОД"

MAX_ERRORS = 6
ALPHABET_RU = "абвгдеёжзийклмнопрстуфхцчшщъыьэюя"

DEFAULT_WORDS = ["яблоко", "молоко", "кошка", "собака", "машина", "чайник", "окно", "дверь",
    "линейка", "карандаш", "тетрадь", "помидор", "огурец", "морковь", "гитара",
    "программист", "алгоритм", "разработчик", "интерпретатор", "компилятор", 
    "переменная", "функция", "массив", "объект", "сервер", "браузер",
    "экскаватор", "велосипед", "микрофон", "клавиатура", "монитор",
    "процессор", "терминал", "консоль", "скрипт", "пакет"]


TEXTS = {
    "start_word_len": "Загадано слово из {} букв.",
    "win": "Поздравляем! Вы угадали слово!",
    "lose": "Проиграли! Загаданное слово было: {}",
    "input_prompt": "Введите ровно одну русскую букву: ",
    "input_error_len": "Нужно ввести ровно один символ. Попробуйте снова.",
    "input_error_char": "Это не русская буква. Попробуйте снова.",
    "stats_errors": "Ошибок: {} из возможных {}",
    "file_not_found": "Файл words.txt не найден. Используем тестовые слова.",
    "called_chars": "Уже названы {}",
    "called_empty": "Пока ничего не названо",
    "menu_1":"1)Играть пока не надоест",
    "menu_2":"2)Сыграть последний раунд",
    "menu_3": "3)Выход",
    "invalid_menu_choice":"Неверный выбор.",
    "invalid_menu_choice_input_prompt":"Введите любую русскую букву, чтобы попробовать снова: ",
    "exit_prompt": "Игра завершена,нажмите любую кнопку, что бы выйти.",
    "not_play_again_prompt": "Введите любую русскую букву. Если отите выйти введите н : ",
    "menu_prompt":"Выберите пункт из меню: ",
    "called_input":"Уже называли"
}

MENU_ART_LOGO = """
████   ███  █      ███   ███  █   █   
█░░░█ █ ░░█ █░    █ ░░█ █ ░░░ █░  █░  
████░░█████░█░░   █████░█░ ░░░█████░░ 
█░░░░ █░░░█░█░░   █░░░█░█░░   █░░░█░░ 
█░░░░░█░░░█░█████ █░░░█░░███  █░░░█░░ 
 ░░    ░░  ░░░░░░░ ░░  ░░ ░░░  ░░  ░░ 
  ░     ░   ░ ░░░░░ ░   ░  ░░░  ░   ░ 
"""

HANGMAN_ART = {
    0: """
  _______
  |     |
  |
  |
  |
  |
__|__
""".strip(),

    1: """
  _______
  |     |
  |     😵
  |
  |
  |
__|__
""".strip(),

    2: """
  _______
  |     |
  |     😵
  |     |
  |
  |
__|__
""".strip(),

    3: """
  _______
  |     |
  |     😵
  |    /|
  |
  |
__|__
""".strip(),

    4: """
  _______
  |     |
  |     😵
  |    /|\\
  |
  |
__|__
""".strip(),

    5: """
  _______
  |     |
  |     😵
  |    /|\\
  |    /
  |
__|__
""".strip(),

    6: """
  _______
  |     |
  |     💀
  |    /|\\
  |    / \\
  |
__|__
""".strip()
}